Core/src/Catalogs/ШаблоныПечатиОфисныхДокументов/ШаблоныПечатиОфисныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныПечатиОфисныхДокументов</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоДляАвтора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлШаблон</name>
    <type>
      <types>CatalogRef.ШаблоныПечатиОфисныхДокументовПрисоединенныеФайлы</types>
    </type>
  </attributes>
</mdclass:Catalog>

Core/src/Catalogs/ШаблоныПечатиОфисныхДокументов/Forms/ФормаПечати/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.ОбъектыПечати) <> Тип("Массив") ИЛИ Параметры.ОбъектыПечати.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектПечати = Параметры.ОбъектыПечати[0];
	
	ДействиеСФайлом = "СохранитьЛокально";
	
	ДанныеФайла = ШаблоныПечатиОфисныхДокументов.СФормироватьДокумент(Параметры.ШаблонПечати, ОбъектПечати, УникальныйИдентификатор);
	ИмяФайла = ДанныеФайла.ИмяФайла;
	
	Элементы.ФорматФайлаDOCX.Видимость = (ДанныеФайла.Расширение = "docx");
	Элементы.ФорматФайлаODT.Видимость = (ДанныеФайла.Расширение = "odt");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СохранитьФайл(Команда)
	
	Если ДействиеСФайлом = "СохранитьЛокально" Тогда
		ПрисоединенныеФайлыКлиент.СохранитьФайлКак(ДанныеФайла);
	ИначеЕсли ДействиеСФайлом = "СохранитьВПрисоединенныеФайлы" Тогда
		ПрикрепитьГотовыйФайлКОбъектуПечати();
		ПрисоединенныеФайлыКлиент.ОткрытьФайл(ДанныеФайла);
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрикрепитьГотовыйФайлКОбъектуПечати()
	
	ПараметрыФайла = Новый Структура("Автор, ВладелецФайлов, ИмяБезРасширения, РасширениеБезТочки, ВремяИзмененияУниверсальное");
	ПараметрыФайла.Автор = Пользователи.ТекущийПользователь();
	ПараметрыФайла.ВладелецФайлов = ОбъектПечати;
	ПараметрыФайла.ИмяБезРасширения = ДанныеФайла.Наименование;
	ПараметрыФайла.РасширениеБезТочки = ДанныеФайла.Расширение;
	ПараметрыФайла.ВремяИзмененияУниверсальное = ДанныеФайла.ДатаМодификацииУниверсальная;
	
	ПрисоединенныйФайл = ПрисоединенныеФайлы.ДобавитьПрисоединенныйФайл(ПараметрыФайла, ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);
	
	ДанныеФайла = ПрисоединенныеФайлы.ПолучитьДанныеФайла(ПрисоединенныйФайл, УникальныйИдентификатор, Истина);
	
КонецПроцедуры

#КонецОбласти
